# **1. Finding Similar Costumers**

Companies nowadays are implementing product suggestions to provide users with things they are likely to buy. The process often starts by finding similar behaviours among consumers; for this task, we will focus on this part in the specific.
Here you will implement an algorithm to find the most similar match to a consumer given his bank account information. In particular, you will implement your version of the LSH algorithm that takes as input information about a consumer and finds people similar to the one in the study.

**1.1 Set up the data**

For the sake of this first part, not all columns are necessary since comparing each field single handedly can be quite time-expensive. Then, carefully read the linked guide above and try to understand which features will be appropriate for this task (An heads up: some users have more than one transaction record, make sure to handle them all). Once you have finished, project a version of the dataset to work with.

In [ ]:
import pandas as pd
from datetime import date
import datetime
import time
from datetime import timedelta
import csv
from datetime import datetime
from random import randint
from numpy import dot
import numpy as np
from numpy.linalg import norm

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
# import data
data =pd.read_csv('/content/drive/MyDrive/ADM_HW4/bank_transactions.csv',sep=',')

In [ ]:
data

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.0
1,T2,C2142763,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.0
2,T3,C4417068,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.0
3,T4,C5342380,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.0
4,T5,C9031234,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.5
...,...,...,...,...,...,...,...,...,...
1048562,T1048563,C8020229,8/4/90,M,NEW DELHI,7635.19,18/9/16,184824,799.0
1048563,T1048564,C6459278,20/2/92,M,NASHIK,27311.42,18/9/16,183734,460.0
1048564,T1048565,C6412354,18/5/89,M,HYDERABAD,221757.06,18/9/16,183313,770.0
1048565,T1048566,C6420483,30/8/78,M,VISAKHAPATNAM,10117.87,18/9/16,184706,1000.0
1048566,T1048567,C8337524,5/3/84,M,PUNE,75734.42,18/9/16,181222,1166.0

In [ ]:
# drop non necessary columns
data = data.drop(['CustomerID','TransactionID'],axis=1)
data

,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.0
1,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.0
2,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.0
3,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.0
4,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.5
...,...,...,...,...,...,...,...
1048562,8/4/90,M,NEW DELHI,7635.19,18/9/16,184824,799.0
1048563,20/2/92,M,NASHIK,27311.42,18/9/16,183734,460.0
1048564,18/5/89,M,HYDERABAD,221757.06,18/9/16,183313,770.0
1048565,30/8/78,M,VISAKHAPATNAM,10117.87,18/9/16,184706,1000.0
1048566,5/3/84,M,PUNE,75734.42,18/9/16,181222,1166.0

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048567 entries, 0 to 1048566
Data columns (total 7 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   CustomerDOB              1045170 non-null  object
 1   CustGender               1047467 non-null  object
 2   CustLocation             1048416 non-null  object
 3   CustAccountBalance       1046198 non-null  float64
 4   TransactionDate          1048567 non-null  object
 5   TransactionTime          1048567 non-null  int64
 6   TransactionAmount (INR)  1048567 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 56.0+ MB

In [ ]:
# save the new csv file 
data = data.to_csv("/content/drive/MyDrive/ADM_HW4/bank_transactions_new_version.csv", index=False)

**1.2 Fingerprint hashing**

Implementing our minhash function from scratch.

In [ ]:
# We apply the definition of Hash Function.
def Hash(Number,w):
    n =2^32 -1
    return sum([ord(x)*(w^i) for i,x in enumerate(Number)])%n

In [ ]:
def MinHash(ListfElements,w,perm):
    list_ = [0 for i in range(len(ListfElements))]
    for i, Number in enumerate(ListfElements):
        if not isinstance(Number,int):
            if isinstance(Number,str): 
                Number = Hash(Number,w)
        l = float('inf')
        for perm_ in perm:
            a, b = perm_
            z = (a*Number+b)%w
            if(l > z):
                l = z
        list_[i] = z
    return list_

In [ ]:
data =pd.read_csv('/content/drive/MyDrive/ADM_HW4/bank_transactions_new_version.csv')

In [ ]:
data.head()

,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.0
1,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.0
2,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.0
3,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.0
4,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.5

In [ ]:
w  = 256
MaximumValue = 2^32 -1
n  = 12
perm = [(randint(1,MaximumValue),randint(1,MaximumValue)) for i in range(n)]

Process the dataset and add each record to the MinHash.

In [ ]:
# we compute the Hash in order to obatin the third column "hashed" 
start = time.time()
data['hashed']  = [MinHash([*x[1]],w,perm) for x in data.iterrows()]
end = time.time()
print(end - start, 's')

0it [13:39, ?it/s]

102.22004580497742 s

In [ ]:
data.head()

,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),hashed
0,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.0,"[79, 125, 62, 254.14999999996508, 131, 81, 79.0]"
1,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.0,"[85, 243, 10, 17.87000000000262, 131, 30, 153.0]"
2,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.0,"[220, 125, 177, 248.11999999999534, 131, 216, ..."
3,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.0,"[243, 125, 177, 245.82999999821186, 131, 6, 36.0]"
4,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.5,"[108, 125, 131, 79.89000000001397, 131, 204, 1..."

**1.3 Locality Sensitive Hashing**

After importing the dataset report the most similar users and comparing them against the bank_transactions dataset.

In [ ]:
# import data 
data1 =pd.read_csv('/content/drive/MyDrive/ADM_HW4/query_users.csv',sep=',')

In [ ]:
data1.head()

,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,27/7/78,M,DELHI,94695.61,2/9/16,140310,65.0
1,6/11/92,M,PANCHKULA,7584.09,2/9/16,120214,6025.0
2,14/8/91,M,PATNA,7180.60,10/8/16,221732,541.5
3,3/1/87,M,CHENNAI,56847.75,29/8/16,144138,1000.0
4,4/1/95,M,GURGAON,84950.13,25/9/16,233309,80.0

In [ ]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   CustomerDOB              50 non-null     object
 1   CustGender               50 non-null     object
 2   CustLocation             50 non-null     object
 3   CustAccountBalance       50 non-null     float64
 4   TransactionDate          50 non-null     object
 5   TransactionTime          50 non-null     int64
 6   TransactionAmount (INR)  50 non-null     float64
dtypes: float64(2), int64(1), object(4)
memory usage: 2.9+ KB

In [ ]:
# we compute the Hash in order to obatin the third column "hashed" 
start = time.time()
data1['hashed']  = [MinHash([*x[1]],w,perm) for x in data1.iterrows()]
end = time.time()
print(end - start, 's')

0.006717681884765625 s

In [ ]:
data1.head()

,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),hashed
0,27/7/78,M,DELHI,94695.61,2/9/16,140310,65.0,"[59, 243, 36, 223.0299999997951, 62, 10, 231.0]"
1,6/11/92,M,PANCHKULA,7584.09,2/9/16,120214,6025.0,"[79, 243, 148, 114.07000000000698, 62, 138, 95.0]"
2,14/8/91,M,PATNA,7180.60,10/8/16,221732,541.5,"[243, 243, 125, 49.80000000001746, 59, 76, 182.5]"
3,3/1/87,M,CHENNAI,56847.75,29/8/16,144138,1000.0,"[82, 243, 56, 122.25, 39, 246, 232.0]"
4,4/1/95,M,GURGAON,84950.13,25/9/16,233309,80.0,"[200, 243, 85, 76.99000000022352, 105, 107, 64.0]"

In [ ]:
def cosine_similarity(vec1,vec2):
    cosine_similarity = dot(vec1,vec2)/(norm(vec1)*norm(vec2))
    return cosine_similarity

def best_match(Queries):
    hash  = np.array(Queries.hashed)/max(Queries.hashed)
    return max([(cosine_similarity(hash,(np.array(x)/max(x))),i) for i,x in enumerate(data.hashed)])

In [ ]:
dic = []
for i in range(len(data1)):
    if i in data1.index:
        x = best_match(data1.loc[i])
        dic.append(x[1])

In [ ]:
data1

,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),hashed
0,27/7/78,M,DELHI,94695.61,2/9/16,140310,65.00,"[59, 243, 36, 223.0299999997951, 62, 10, 231.0]"
1,6/11/92,M,PANCHKULA,7584.09,2/9/16,120214,6025.00,"[79, 243, 148, 114.07000000000698, 62, 138, 95.0]"
2,14/8/91,M,PATNA,7180.60,10/8/16,221732,541.50,"[243, 243, 125, 49.80000000001746, 59, 76, 182.5]"
3,3/1/87,M,CHENNAI,56847.75,29/8/16,144138,1000.00,"[82, 243, 56, 122.25, 39, 246, 232.0]"
4,4/1/95,M,GURGAON,84950.13,25/9/16,233309,80.00,"[200, 243, 85, 76.99000000022352, 105, 107, 64.0]"
5,10/1/81,M,WORLD TRADE CENTRE BANGALORE,23143.95,11/9/16,192906,303.00,"[10, 243, 62, 102.84999999997672, 177, 118, 73.0]"
6,20/9/76,F,CHITTOOR,15397.80,28/8/16,92633,20.00,"[154, 125, 197, 117.39999999996508, 131, 143, ..."
7,10/4/91,M,MOHALI,426.30,2/8/16,203754,50.00,"[128, 243, 200, 92.89999999999964, 131, 22, 14..."
8,19/3/90,M,MOHALI,4609.34,26/8/16,184015,300.00,"[246, 243, 200, 46.820000000006985, 59, 169, 4.0]"
9,19/12/70,M,SERAMPORE,6695988.46,27/8/16,144030,299.00,"[125, 243, 62, 198.58000001311302, 223, 66, 23..."
10,26/2/89,M,BANGALORE,5974.56,6/8/16,220151,300.00,"[148, 243, 148, 214.88000000000466, 82, 65, 4.0]"
11,22/8/84,M,BANGALORE,268.09,11/8/16,203131,2244.00,"[125, 243, 148, 38.06999999999971, 223, 29, 17..."
12,21/9/79,M,LUDHIANA,38785.44,22/8/16,185953,690.00,"[131, 243, 56, 177.12000000011176, 16, 199, 14.0]"
13,17/6/92,F,BANGALORE,19767.76,12/8/16,232822,4912.00,"[82, 125, 148, 18.479999999981374, 131, 170, 9..."
14,1/8/86,M,HYDERABAD,21713.09,11/9/16,150136,284.00,"[85, 243, 82, 217.07000000000698, 177, 216, 14..."
15,1/1/1800,M,GURGAON,28333.11,31/8/16,160307,1000.00,"[39, 243, 85, 157.53000000002794, 148, 165, 23..."
16,17/12/91,F,MUMBAI,1981.59,5/8/16,214323,401.00,"[246, 125, 177, 24.56999999999971, 197, 165, 2..."
17,1/1/1800,M,NEW DELHI,176303.02,9/8/16,133414,1347.00,"[39, 243, 174, 201.45999999996275, 148, 122, 2..."
18,7/7/93,M,GURGAON,27930.23,8/9/16,25212,60.00,"[108, 243, 85, 107.29000000003725, 39, 52, 116.0]"
19,21/6/89,M,CHENNAI,6399.24,3/8/16,201328,404.00,"[13, 243, 56, 254.51999999998952, 16, 32, 92.0]"
20,18/9/82,F,NOIDA,498859.06,22/8/16,94901,40000.00,"[108, 125, 131, 110.38000000081956, 16, 83, 20..."
21,21/8/62,F,BANGALORE,108941.24,14/9/16,154153,1280.00,"[16, 125, 148, 192.52000000001863, 56, 191, 16.0]"
22,17/8/88,M,NEW DELHI,125934.77,10/8/16,104836,197.00,"[128, 243, 174, 131.70999999996275, 59, 236, 1..."
23,5/12/65,M,AHMEDABAD,47403.83,28/8/16,195559,3460.00,"[62, 243, 151, 0.09000000008381903, 131, 209, ..."
24,10/7/94,M,PRAKASAM DIST (AP),26655.05,2/8/16,220553,150.00,"[59, 243, 16, 218.15000000002328, 131, 95, 138.0]"
25,25/10/75,M,BANGALORE,10072.85,4/8/16,144551,862.44,"[243, 243, 148, 11.550000000017462, 56, 17, 14..."
26,1/11/89,M,VADODARA,101424.95,25/9/16,183541,990.00,"[148, 243, 220, 117.85000000009313, 105, 19, 2.0]"
27,16/10/83,M,MUMBAI,64389.91,9/9/16,193308,220.00,"[197, 243, 177, 23.930000000167638, 79, 148, 2..."
28,16/2/87,M,HYDERABAD,12793.16,8/8/16,212021,199.00,"[62, 243, 82, 114.67999999999302, 108, 211, 24..."
29,1/1/1800,M,MUMBAI,205.70,30/8/16,160056,1933.52,"[39, 243, 177, 139.09999999999945, 85, 24, 198..."
30,10/12/86,M,AURANGABAD,170981.48,7/8/16,205242,1137.00,"[174, 243, 223, 174.04000000003725, 223, 198, ..."
31,6/6/69,M,HODEL,995009.07,4/8/16,181055,3000.00,"[105, 243, 200, 104.60999999940395, 56, 185, 1..."
32,1/1/1800,M,CHENNAI,6771.64,17/8/16,211438,282.90,"[39, 243, 56, 115.72000000000116, 82, 114, 122..."
33,7/4/84,F,NEW DELHI,103832.66,9/9/16,141846,1290.23,"[82, 125, 174, 199.18000000016764, 79, 10, 251..."
34,15/9/91,M,SECUNDERABAD,602296.81,11/9/16,184655,2937.48,"[105, 243, 56, 170.63000000081956, 177, 41, 25..."
35,28/1/91,F,N T PUNE,23299.53,10/9/16,220846,212.00,"[82, 125, 125, 97.18999999994412, 13, 178, 28.0]"
36,6/2/86,M,NEW DELHI,398248.26,1/8/16,220403,3180.00,"[79, 243, 174, 45.980000000447035, 246, 229, 1..."
37,31/7/87,M,BANGALORE,1660.45,14/8/16,203911,100.86,"[62, 243, 148, 62.349999999998545, 102, 49, 31..."
38,29/5/84,M,NEW DELHI,11349.64,2/9/16,144724,5598.00,"[131, 243, 174, 193.71999999997206, 62, 156, 2.0]"
39,22/1/88,M,HYDERABAD,10994.33,2/8/16,153712,60.00,"[128, 243, 82, 213.5899999999965, 131, 32, 116.0]"
40,18/2/87,M,CHENNAI,2887.39,24/8/16,181703,20.00,"[33, 243, 56, 121.97000000000116, 243, 241, 22..."
41,1/3/86,M,IMPHAL,31987.86,19/8/16,145712,203.00,"[174, 243, 223, 248.78000000002794, 154, 96, 7..."
42,2/11/81,F,NEW DELHI,85626.45,12/9/16,105636,1500.00,"[105, 125, 174, 16.3499999998603, 85, 204, 212.0]"
43,2/12/90,F,NEW DELHI,3156.39,4/8/16,204616,199.00,"[36, 125, 174, 164.97000000000116, 56, 136, 24..."
44,6/9/72,M,GHAZIABAD,225234.23,24/8/16,171054,347.30,"[131, 243, 131, 243.29000000003725, 243, 50, 6..."
45,30/5/90,F,DELHI,1089764.73,5/9/16,130529,250.00,"[85, 125, 36, 156.78999999910593, 128, 71, 134.0]"
46,26/9/74,M,CHENNAI,24678.92,17/8/16,215806,60.00,"[223, 243, 56, 79.15999999991618, 82, 226, 116.0]"
47,2/7/91,M,DIST NORTH GOA BARDEZ,518766.40,14/9/16,182251,90.00,"[16, 243, 128, 251.2000000011176, 56, 45, 38.0]"
48,7/4/94,F,PUNE,8085.25,5/9/16,191233,1014.00,"[59, 125, 197, 120.75, 128, 39, 42.0]"
49,5/1/87,M,DELHI,10989.03,4/9/16,113240,240.00,"[108, 243, 36, 91.69000000000233, 243, 248, 16..."

In [ ]:
data.loc[dic]

,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),hashed
747502,27/7/78,M,DELHI,94695.61,2/9/16,140310,65.00,"[59, 243, 36, 223.0299999997951, 62, 10, 231.0]"
729233,6/11/92,M,PANCHKULA,7584.09,2/9/16,120214,6025.00,"[79, 243, 148, 114.07000000000698, 62, 138, 95.0]"
315449,14/8/91,M,PATNA,7180.60,10/8/16,221732,541.50,"[243, 243, 125, 49.80000000001746, 59, 76, 182.5]"
640748,3/1/87,M,CHENNAI,56847.75,29/8/16,144138,1000.00,"[82, 243, 56, 122.25, 39, 246, 232.0]"
11626,4/1/95,M,GURGAON,84950.13,25/9/16,233309,80.00,"[200, 243, 85, 76.99000000022352, 105, 107, 64.0]"
937293,10/1/81,M,WORLD TRADE CENTRE BANGALORE,23143.95,11/9/16,192906,303.00,"[10, 243, 62, 102.84999999997672, 177, 118, 73.0]"
619274,20/9/76,F,CHITTOOR,15397.80,28/8/16,92633,20.00,"[154, 125, 197, 117.39999999996508, 131, 143, ..."
79635,10/4/91,M,MOHALI,426.30,2/8/16,203754,50.00,"[128, 243, 200, 92.89999999999964, 131, 22, 14..."
600251,19/3/90,M,MOHALI,4609.34,26/8/16,184015,300.00,"[246, 243, 200, 46.820000000006985, 59, 169, 4.0]"
582929,19/12/70,M,SERAMPORE,6695988.46,27/8/16,144030,299.00,"[125, 243, 62, 198.58000001311302, 223, 66, 23..."
126684,26/2/89,M,BANGALORE,5974.56,6/8/16,220151,300.00,"[148, 243, 148, 214.88000000000466, 82, 65, 4.0]"
294910,22/8/84,M,BANGALORE,268.09,11/8/16,203131,2244.00,"[125, 243, 148, 38.06999999999971, 223, 29, 17..."
569694,21/9/79,M,LUDHIANA,38785.44,22/8/16,185953,690.00,"[131, 243, 56, 177.12000000011176, 16, 199, 14.0]"
278321,17/6/92,F,BANGALORE,19767.76,12/8/16,232822,4912.00,"[82, 125, 148, 18.479999999981374, 131, 170, 9..."
930242,1/8/86,M,HYDERABAD,21713.09,11/9/16,150136,284.00,"[85, 243, 82, 217.07000000000698, 177, 216, 14..."
704764,1/1/1800,M,GURGAON,28333.11,31/8/16,160307,1000.00,"[39, 243, 85, 157.53000000002794, 148, 165, 23..."
153595,17/12/91,F,MUMBAI,1981.59,5/8/16,214323,401.00,"[246, 125, 177, 24.56999999999971, 197, 165, 2..."
186937,1/1/1800,M,NEW DELHI,176303.02,9/8/16,133414,1347.00,"[39, 243, 174, 201.45999999996275, 148, 122, 2..."
862574,7/7/93,M,GURGAON,27930.23,8/9/16,25212,60.00,"[108, 243, 85, 107.29000000003725, 39, 52, 116.0]"
59641,21/6/89,M,CHENNAI,6399.24,3/8/16,201328,404.00,"[13, 243, 56, 254.51999999998952, 16, 32, 92.0]"
539444,18/9/82,F,NOIDA,498859.06,22/8/16,94901,40000.00,"[108, 125, 131, 110.38000000081956, 16, 83, 20..."
1000260,21/8/62,F,BANGALORE,108941.24,14/9/16,154153,1280.00,"[16, 125, 148, 192.52000000001863, 56, 191, 16.0]"
298056,17/8/88,M,NEW DELHI,125934.77,10/8/16,104836,197.00,"[128, 243, 174, 131.70999999996275, 59, 236, 1..."
656802,5/12/65,M,AHMEDABAD,47403.83,28/8/16,195559,3460.00,"[62, 243, 151, 0.09000000008381903, 131, 209, ..."
82521,10/7/94,M,PRAKASAM DIST (AP),26655.05,2/8/16,220553,150.00,"[59, 243, 16, 218.15000000002328, 131, 95, 138.0]"
166459,25/10/75,M,BANGALORE,10072.85,4/8/16,144551,862.44,"[243, 243, 148, 11.550000000017462, 56, 17, 14..."
6846,1/11/89,M,VADODARA,101424.95,25/9/16,183541,990.00,"[148, 243, 220, 117.85000000009313, 105, 19, 2.0]"
851715,16/10/83,M,MUMBAI,64389.91,9/9/16,193308,220.00,"[197, 243, 177, 23.930000000167638, 79, 148, 2..."
221234,16/2/87,M,HYDERABAD,12793.16,8/8/16,212021,199.00,"[62, 243, 82, 114.67999999999302, 108, 211, 24..."
704275,1/1/1800,M,MUMBAI,205.70,30/8/16,160056,1933.52,"[39, 243, 177, 139.09999999999945, 85, 24, 198..."
252011,10/12/86,M,AURANGABAD,170981.48,7/8/16,205242,1137.00,"[174, 243, 223, 174.04000000003725, 223, 198, ..."
168508,6/6/69,M,HODEL,995009.07,4/8/16,181055,3000.00,"[105, 243, 200, 104.60999999940395, 56, 185, 1..."
435187,1/1/1800,M,CHENNAI,6771.64,17/8/16,211438,282.90,"[39, 243, 56, 115.72000000000116, 82, 114, 122..."
844799,7/4/84,F,NEW DELHI,103832.66,9/9/16,141846,1290.23,"[82, 125, 174, 199.18000000016764, 79, 10, 251..."
936305,15/9/91,M,SECUNDERABAD,602296.81,11/9/16,184655,2937.48,"[105, 243, 56, 170.63000000081956, 177, 41, 25..."
774501,1/1/76,F,NOIDA,28085.80,6/9/16,195513,100.00,"[79, 125, 131, 101.40000000002328, 13, 175, 12.0]"
409363,7/4/83,M,AMBALA,5366.19,18/8/16,195916,97.00,"[82, 243, 177, 46.36999999999534, 246, 228, 19..."
158543,1/1/1800,F,HYDERABAD,4686.44,4/8/16,112941,3662.00,"[39, 125, 82, 28.119999999995343, 56, 27, 18.0]"
1002557,16/7/92,M,FARIDKOT,1153.66,14/9/16,132948,300.00,"[128, 243, 174, 182.1800000000003, 56, 156, 4.0]"
63225,22/3/91,M,GURGAON,10459.92,2/8/16,65959,171.36,"[131, 243, 85, 210.1600000000035, 131, 17, 117..."
805307,22/8/87,M,CHENNAI,10000.04,4/9/16,222719,665.50,"[39, 243, 56, 128.9200000000128, 243, 249, 218.5]"
522054,3/9/90,M,HUBLI,100773.98,19/8/16,161751,12.99,"[174, 243, 200, 249.54000000003725, 154, 97, 5..."
691833,11/11/90,F,MUMBAI,9950.15,30/8/16,182103,109.00,"[108, 125, 177, 5.449999999982538, 85, 225, 21..."
382180,1/1/1800,F,NEW DELHI,177604.13,13/8/16,185338,188.00,"[39, 125, 174, 174.99000000022352, 39, 134, 24..."
515368,1/7/81,M,NOIDA,9515.22,24/8/16,11054,258.00,"[154, 243, 131, 242.05999999999767, 243, 50, 6..."
64700,28/6/80,F,VIDISHA,126036.13,2/8/16,21607,550.00,"[85, 125, 36, 158.99000000022352, 131, 81, 122.0]"
430978,29/4/86,M,CHENNAI,5712.96,17/8/16,182748,60.00,"[223, 243, 56, 86.0799999999872, 82, 212, 116.0]"
995127,24/8/88,M,PETROL PUMP BHANDUP W MUMBAI,945.31,14/9/16,120533,346.00,"[33, 243, 131, 254.12999999999738, 56, 51, 38.0]"
626428,6/10/86,F,GOREGAON EAST MUMBAI MUMBAI,20451.95,25/8/16,163952,79.00,"[62, 125, 200, 138.85000000003492, 151, 32, 41.0]"
276515,18/6/47,M,DELHI,398639.81,11/8/16,114709,1030.00,"[105, 243, 36, 91.63000000081956, 223, 243, 15..."

#**2. Grouping customers together!**

**2.1 Getting your data + feature engineering**

In [ ]:
data =pd.read_csv('/content/drive/MyDrive/ADM_HW4/bank_transactions.csv',sep=',')

In [ ]:
df1 = data.groupby('CustomerID')['TransactionID'].apply(list).reset_index(name='TransactionID')
df2 = data.groupby('CustomerID')['CustomerDOB'].apply(list).reset_index(name='CustomerDOB')
df3 = data.groupby('CustomerID')['CustGender'].apply(list).reset_index(name='CustGender')
df4 = data.groupby('CustomerID')['CustLocation'].apply(list).reset_index(name='CustLocation')
df5 = data.groupby('CustomerID')['CustAccountBalance'].apply(list).reset_index(name='CustAccountBalance')
df6 = data.groupby('CustomerID')['TransactionDate'].apply(list).reset_index(name='TransactionDate')
df7 = data.groupby('CustomerID')['TransactionTime'].apply(list).reset_index(name='TransactionTime')
df8 = data.groupby('CustomerID')['TransactionAmount (INR)'].apply(list).reset_index(name='TransactionAmount (INR)')

In [ ]:
data1 = pd.merge(df1,df2,on="CustomerID")
data2 = pd.merge(data1,df3,on="CustomerID")
data3 = pd.merge(data2,df4,on="CustomerID")
data4 = pd.merge(data3,df5,on="CustomerID")
data5 = pd.merge(data4,df6,on="CustomerID")
data6 = pd.merge(data5,df7,on="CustomerID")
data7 = pd.merge(data6,df8,on="CustomerID")
data7

,CustomerID,TransactionID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,C1010011,"[T33671, T173509]","[19/8/92, 5/8/83]","[F, M]","[NOIDA, NEW DELHI]","[32500.73, 120180.54]","[26/9/16, 9/8/16]","[123813, 11229]","[4750.0, 356.0]"
1,C1010012,[T363022],[28/7/94],[M],[MUMBAI],[24204.49],[14/8/16],[204409],[1499.0]
2,C1010014,"[T89544, T251648]","[4/6/92, 19/8/84]","[F, M]","[MUMBAI, MUMBAI]","[38377.14, 161848.76]","[1/8/16, 7/8/16]","[154451, 220305]","[1205.0, 250.0]"
3,C1010018,[T971994],[29/5/90],[F],[CHAMPARAN],[496.18],[15/9/16],[170254],[30.0]
4,C1010024,[T401396],[21/6/65],[M],[KOLKATA],[87058.65],[18/8/16],[141103],[5000.0]
...,...,...,...,...,...,...,...,...,...
884260,C9099836,[T226394],[24/12/90],[M],[BHIWANDI],[133067.23],[7/8/16],[5122],[691.0]
884261,C9099877,[T980444],[9/6/96],[M],[BANGALORE],[96063.46],[15/9/16],[120255],[222.0]
884262,C9099919,[T401232],[21/10/93],[M],[GUNTUR],[5559.75],[18/8/16],[122533],[126.0]
884263,C9099941,[T659168],[22/4/95],[M],[CHENNAI],[35295.92],[28/8/16],[213722],[50.0]
884264,C9099956,[T29189],[11/9/82],[M],[MUSSOORIE],[6968.93],[25/9/16],[225732],[855.0]

# **Algorithmic Question**

An imaginary university wants to restrict its student’s entrance to the campus. Suppose that there are N entrances, M students and G guards. Due to the security measures, each student is known to be assigned a gate through which they should enter the university.

Assume that the university's head of the guards knows the order in which the students are coming to the university (yeah, they know you more than you know about yourself!). He wants you to help him if having only G guards is enough to address the restrictions they wish to apply (in other words, whether there will be a moment when more than G entrances should be opened or not).

In [ ]:
# enter the values of N, M and G
# n: number of entrances to the university, m: number of students in the university, and g: number of guards
n, m, g = map(int, input().split())
# entrance that has been assigned to the each m student 
a = list(map(int, input().split()))
# initialize x
x = 0
for i in range(1, len(a)):
  if a[i] not in a[:i] and a[i-1] in a[i+1:]:
    x = x+1

# if g: guards is enough return yes if not return no    
if g > x :
  print("YES")
else:
  print("NO")

4 5 1
1 1 3 3 3
YES